JTLey/UC-Davis/TI CC3200 Code Composer/Lab4/Code/main_stable.c
    LOOP_FOREVER();
}

void
SPIInit()
{
    //
    // Reset SPI
    //
    MAP_SPIReset(GSPI_BASE);

    //
    // Set up SPI FIFO
    //
    MAP_SPIFIFOEnable(GSPI_BASE, SPI_TX_FIFO | SPI_RX_FIFO);

    //
    // Configure SPI interface
    //
    MAP_SPIConfigSetExpClk(GSPI_BASE,MAP_PRCMPeripheralClockGet(PRCM_GSPI),
                     SPI_IF_BIT_RATE,SPI_MODE_MASTER,SPI_SUB_MODE_3, // Inverse clock (1 on idle), Sampled on 2nd (rising) edge.
                     (SPI_SW_CTRL_CS |
                     SPI_4PIN_MODE |
                     SPI_TURBO_OFF |
                     SPI_CS_ACTIVELOW | // 0 means Write, 1 means don't write
                     SPI_WL_8));

    //
    // Enable SPI for communication
    //
    MAP_SPIEnable(GSPI_BASE);
}

void
DrawString(char *s, int x, int y)
{
    int i;
    for(i = 0; i < strlen(s); i++)
    {
        drawChar(x + i*6, y, s[i], WHITE, BLACK, 1);
    }
}

void
DrawFontTable()
{
    int numchars = 127;
    int width = 128;
    int height = 128;
    int x, y;
    char i = 0;
    while(i < numchars)
    {
        for(y = 0; y < height; y += height/10)
        {
            for(x = 0; x < width; x += width / 10)
            {
                drawChar(x, y, i, WHITE, BLACK, 1);
                i++;
            }
        }
    }
}

void
testloop()
{
    while(1)
    {
            fillScreen(BLACK);
            DrawFontTable();
            MAP_UtilsDelay(20000000);
            fillScreen(BLACK);
            DrawString("Hello World!", 5, 5);
            MAP_UtilsDelay(20000000);
            lcdTestPattern();
            MAP_UtilsDelay(10000000);
            lcdTestPattern2();
            MAP_UtilsDelay(10000000);
            fillScreen(BLACK);
            testlines(BLUE); // takes too long
            fillScreen(BLACK);
            testfastlines(RED, BLUE);
            MAP_UtilsDelay(20000000);
            fillScreen(BLACK);
            testdrawrects(CYAN);
            MAP_UtilsDelay(20000000);
            fillScreen(BLACK);
            testfillrects(GREEN, MAGENTA);
            fillScreen(BLACK);
            testfillcircles(20, MAGENTA);
            MAP_UtilsDelay(20000000);
            fillScreen(BLACK);
            testdrawcircles(20, YELLOW);
            MAP_UtilsDelay(20000000);
            fillScreen(BLACK);
            testroundrects();
            MAP_UtilsDelay(20000000);
            fillScreen(BLACK);
            testtriangles();
            MAP_UtilsDelay(10000000);
    }
}

//*****************************************************************************
//
//! Main 
//!
//! \param  none
//!
//! This function
//!    1. Invokes the SLHost task
//!    2. Invokes the MqttClient
//!
//! \return None
//!
//*****************************************************************************
void main()
{ 
    long lRetVal = -1;
    //
    // Initialize the board configurations
    //
    BoardInit();

    //
    // Pinmux for UART
    //
    PinMuxConfig();

    //
    // Configuring UART
    //
    InitTerm();

    //
    // Display Application Banner
    //
    DisplayBanner("MQTT_Client");

    // Adafruit stuff
    SPIInit();
    Adafruit_Init();
    //testloop();

    //
    // Start the SimpleLink Host
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    //
    // Start the MQTT Client task
    //
    osi_MsgQCreate(&g_PBQueue,"PBQueue",sizeof(osi_messages),10);
    lRetVal = osi_TaskCreate(MqttClient,
                            (const signed char *)"Mqtt Client App",
                            OSI_STACK_SIZE, NULL, 2, NULL );

    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }
    //
    // Start the task scheduler
    //
    osi_start();
}

//*****************************************************************************
//
//! This function updates the date and time of CC3200.
//!
//! \param None
//!
//! \return
//!     0 for success, negative otherwise
//!
//*****************************************************************************

static int set_time()
{
    long retVal;

    g_time.tm_day = DATE;
    g_time.tm_mon = MONTH;
    g_time.tm_year = YEAR;
    g_time.tm_sec = HOUR;
    g_time.tm_hour = MINUTE;
    g_time.tm_min = SECOND;

    retVal = sl_DevSet(SL_DEVICE_GENERAL_CONFIGURATION,
                          SL_DEVICE_GENERAL_CONFIGURATION_DATE_TIME,
                          sizeof(SlDateTime),(unsigned char *)(&g_time));

    ASSERT_ON_ERROR(retVal);
    return SUCCESS;
}
